posts/atualizações.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-17 Sat 21:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>[[file:../index.html][Atualizações]]</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title"><a href="../index.html">Atualizações</a></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org81c98af">Deletei uma porrada de contas</a></li>
<li><a href="#org587409e">VSCode virou meu Desktop</a></li>
<li><a href="#org7ae0a6d">Bem, é isso.</a></li>
</ul>
</div>
</div>
<hr />

<p>
Quanto tempo, caro leitor! Espero que esteja tudo bem com você. Bom, perdoe a falta de artigos nos últimos tempos, os meses finais de 2023 foram muito agitados pra mim, fim da escola e etc.
</p>

<p>
Enfim, vamos às coisas que andei fazendo nos últimos meses. Canal no Youtube
</p>

<p>
Eu criei um canal no youtube no início desse ano, o nome dele é só um nome temporário, mas o que eu vou fazer nele já está decidido: Vídeos sobre ferramentas Linux.
</p>

<p>
Bom, o foco maior seria para ferramentas suckless, mas não faz mal comentar sobre outras coisas, como por exemplo o Neomutt (cliente de e-mail para terminal).
</p>

<div id="outline-container-org81c98af" class="outline-2">
<h2 id="org81c98af">Deletei uma porrada de contas</h2>
<div class="outline-text-2" id="text-org81c98af">
<p>
Outra coisa que fiz foi deletar uma porrada de contas, foi algo na casa de 6 contas de serviços diferentes, e eu ainda não terminei, falta muito para eu me sentir realmente satisfeito.
</p>

<p>
O que eu consideraria como contas essenciais seriam as minhas contas de E-mail, Github e Google, e vou reduzir ao máximo as demais. Fiz isso porque eu não gosto de redes sociais, nem de serviços que eu considero desnecessários.
</p>

<p>
Espero em breve ter o mínimo de contas possível, porque dessa forma será mais fácil de mante-las seguras com senhas novas a cada 7 ou 15 dias, autenticação de 2 fatores atualizada, códigos de recuperação re-gerados, enfim, vai ser algo que me beneficia a longo termo.
</p>
</div>
</div>

<div id="outline-container-org587409e" class="outline-2">
<h2 id="org587409e">VSCode virou meu Desktop</h2>
<div class="outline-text-2" id="text-org587409e">
<p>
Apesar de não gostar da Microsoft, tenho que admitir que eu amo 2 produtos dela: O VSCode e o Github. A integração dos dois também é um puro deleite.
</p>

<p>
O meu workflow no VSCode é extremamente simples, porém, satisfatório. Dentro dele eu consigo:
</p>

<ul class="org-ul">
<li>Editar o código de meus projetos</li>
<li>Previsualizar eles em tempo real</li>
<li>Formata-los automaticamente</li>
<li>Compartilhar snippets com uma tecla de atalho</li>
<li>Gerenciar o Git com extrema facilidade</li>
<li>Entre outras coisas</li>
</ul>

<p>
Ultimamente eu não usava muito o meu computador, mas agora que eu comecei a estudar javascript, eu mal saio dele, principalmente por conta dessa experiência incrível com o VSCode. Vamos ver quanto tempo isso vai durar.
</p>
</div>
</div>

<div id="outline-container-org7ae0a6d" class="outline-2">
<h2 id="org7ae0a6d">Bem, é isso.</h2>
<div class="outline-text-2" id="text-org7ae0a6d">
<p>
Acho que eu já disse tudo o que eu tinha a dizer, mas espero ter conseguido te entreter um pouco.
</p>

<p>
Até o próximo post!
</p>
</div>
</div>
</div>
</body>
</html>